[
  {
    "path": "posts/2020-12-13-analyzing-my-running-performance-using-strava-data/",
    "title": "Analyzing my 2020 running performance",
    "description": "Exploring my year in running using data from the Strava app",
    "author": [
      {
        "name": "Cody Tuttle",
        "url": "https://codyrtuttle.netlify.app/"
      }
    ],
    "date": "2021-03-27",
    "categories": [],
    "contents": "\nHello, folks! In this post I’ll be looking at my running performance over the last year by analyzing my running data from the Strava app. Before I start that, here’s a bit of background on how I’ve experienced a new-found love of running over the last year and what led to this in the first place.\nI believe I’m not the first to point out that this year has been a weird one. Societally, it’s been mostly pretty shitty (until the second week in November when things started looking up a bit). The pandemic has upended every facet of life, hundreds of thousands of people have died needlessly, there were kiler hornets, and I’m sure I’m forgetting about ten other big terrible things that happened (feel free point them out if you feel so inclined). Personally, this year has been a mixed bag for my wife and me. We’ve felt all the terrible things going on in the world at large, and our lives look so much different than we thought they would. While we’ve had our fair share of pain and grief caused by the pandemic, we were left in a relatively good spot - we both work from home in stable jobs, we were able to buy a house in a neighborhood that we love, and we were able to plan to start our family. We don’t take that for granted at all, and we truly grieve with those whose lives have been completely devastated over the last year.\nWhen the pandemic shut everything down for us starting in mid March, one of the more noticeable things to stop for us was working out at the gym. In the wake of that, my wife and I decided to start running more. At the time we were living on the upper floor in a pretty small duplex so we didn’t have a whole lot of space to do anything more than very tame bodyweight workouts inside, and we knew that we needed a physical outlet to get away from the stress of the pandemic and of me finishing my final semester of grad school without the confines of our small living space.\nEnter running. I’ve never been a complete stranger to running over the course of my life, but I’ve also never really embraced it. There have been various fits and starts of running more frequently, but it’s never been what I would call sustained. Mar had periods of more dedicated, sustainable running over the last decade or so, even training for and running a half-marathon. She could always handle distance better than I could, but I liked running faster. Since we moved to Minneapolis in 2017 up until last March, Mar and I ran an average of once every week or two probably, never more than 2 or 3 miles at a time. We liked to run around our first neighborhood here, and there were a few months where we would go run a 3 ish mile loop around a nice lake every weekend. But I’ve never exactly loved running. I’ve done it because I know aerobic exercise is good for me and because it’s a good way for Mar and I to workout together every so often, but I’ve always liked lifting and bodyweights and sprint-type workouts a lot better. Until last March, the farthest I think I’d ever run was five miles tops, probably less. I could do a mile decently fast for a normal non-runner (I think I ran a sub-six minute mile a few times in college), but I never liked running longer distances than that.\nFast forward to now, close to a year since we started that journey, I’ve run almost 1,000 miles since April, the majority of it coming in the last five or so months. Mar and I started running as a way of coping once things shutdown, but somewhere along the way it became a new thing for me, something that I genuinely started to love. We started out slow, running a mile and half or two most days, with a long run of 5.5 or 6 on Friday. Our first week of 20 miles, probably in late April or early May, was a big milestone, as was the time we ran 9 miles (thrice around our normal Friday 3 mile lake loop). June and July brought a bit of a slow-down again, with some minor injuries and tweaks, moving into our new house, and the heat of the summer. But in September I bought a new pair of running shoes (my first in probably six years) and started to get back into it again, and it was the start of a real thing for me. Mar and I still ran together from time to time, but she was in the throes of first trimester nausea, and I was increasing my mileage to 25 to 30 miles a week. I did a ten mile run in mid October at a decent pace, and that might have been what sealed it for me. In November I set out to do another 10-miler but through a weird series of events I ended up running my first half-marathon - my time was 1:50 ish, which while not competitive, is pretty good for someone who started running in earnest in March and had never run a half before. Since then I’ve been doing 30-35 mile weeks with some rest weeks here and there, and I’ve really gotten into it. I found my first running podcasts around a month ago, and started to plan my training more strategically based on what I was learning, easing my pace, incorporating strides, and dedicating one run every week or two to be more of an intervals workout.\nThe throes of winter cold and snow have descended upon Minneapolis by now, so I imagine my training will slow down a bit until mid-March or so, but all of this to say that over the last 9 months I’ve found a new love of running that will be with me for a long time I think. Once the winter thaw comes I’d like to start training for my first marathon (even if it is just by myself, but hopefully I’ll be able to find a race by then), and who knows what will come after that.\nI’ve also started to combine this new-found love of running with my love of data. In October I started downloading my running data from Strava and it’s been fun to explore it since. Today’s post will be a more formal dive into my running performance over the last year, primarily to help me see how far I’ve come and allow me to be proud of myself (something I have a really hard time with most days). Here we go! ***\nSo! To start. I’ll have two broad sections to this analysis. First I’ll do a basic descriptive look at my running performance in 2020, cutting the data by week, month, day of the week, etc. Second, I’ll make an interactive map of all my runs using leaflet so we can visualize where I run and what my typical routes look like.\nI downloaded my Strava account data from the online site, which resulted in getting a big zipped folder of a lot of different files. I know I published this post in February of 2021, but I decided to just analyze the data from 2020 to keep it simple. There are two pieces of that I incorporate here. The first is an overview file of all my activities I’ve recorded on Strava, including the name, date, time, distance, pace, etc. The second is a folder of all of the GPS location data for all of the activities, in GPX format. I’ll get back to the GPX location files here in a bit, and start with the raw activities file.\nThis code chunk loads my packages using pacman and imports and cleans the data from the activities file. Most of the cleaning is converting paces and distances into the units I generally use (miles instead of kilometers, pace in minutes per mile, etc.). Also, shoutout to the lubridate package for making the date-time parsing so painless.\n\n\n\nOne thing I want to point out is the creation of the multiplier and performance variables towards the bottom of the chunk. I wanted a way to compare my runs in a more standardized way that didn’t just use distance or average pace as the metric. Those are instructive indicators, but only to a certain point; I can run long distances, but if my pace isn’t where I want it to be then it doesn’t mean as much. Likewise, I can run at a fast pace, but if I can’t sustain it for longer distances, it also doesn’t mean as much. The performance metric I thought of calculates the distance divided by pace as a multiplier for how long a run is. If I run 60ish minutes for 8 miles at 8 minutes a mile, I’ll get a multiplier of around 1, which leaves my performance at ~60. As opposed to if I run 60 minutes for 10 miles at 6 minutes a mile (which I absolutely can not do), the multiplier would be 1.4ish, and the performance would be 85ish. More on this later.\nFirst things first, I want to do a basic look at my running mileage over time. I’ll start by doing a look by month, then by week.\nHere’s the monthly look.\n\n\n\nNow for weekly:\n\n\n\nThese two graphs show more or less what I explained earlier. My mileage increased throughout spring and early summer 2020, plummeted during the mid-summer, and then started to pick back up again in the fall and through the end of the year to its highest levels. It’s interesting how much the weekly look reveals that the monthly hides - even in the valley of the summer and the peaks of the fall, there’s still a lot of ups and downs. Some of that variation is the ebb and flow of my work and recovery weeks, and some of it is the weather getting harder with snow and such. Though you can’t see it, this bouncy pattern has continued into the new year. One thing I’d like to work on being more consistent with my weekly mileage - trying to ease into smoother increases and decreases in mileage rather than the stark up and downs we see here.\nObviously I knew approximately what these charts would look like. One thing I’m not as sure of how my runs break down on days of the week and time of day, both in terms of the number of runs and total mileage. This next graphs look at both the number of runs and total mileage by day of the week.\n\n\n\nThis is new to me! Wednesdays were my biggest days for running overall and second biggest day for mileage - I wasn’t expecting that. I was thinking Fridays might be my biggest running day, but I guess not. Saturdays were my biggest days mileage-wise, which isn’t a surprise as that’s mroe a long run day for most runners (including me), but Wednesdays got close to it. The pattern seems to have been more runs with lower mileage on Wednesdays and fewer runs with higher mileage on Saturdays. So interesting.\nNow I want to go beyond the mileage piece and look more at the performance aspect that I touched on earlier. While it’s insightful to look at distance, it’s also instructive to think about my efficiency and speed as a runner. Enter the calculation I talked about above for performance. There are a few other caveats that I want to put in here though. While the calculation I came up with (imho) is pretty good and standardizes a lot of a run, it can fall victim to extremes, either mileage wise or speed wise. Middle distance and smooth pace is more reliable. So I’ll take it with a bit of a grain of salt, and you probably should, too.\nWhat I’ll do with the performance metric is chart it across month and week, probably as a median to do a better job of smoothing outliers during those periods. I had half a mind to do a simple regression to try to pick out the best predictors of my performance but honestly, the time series nature of it would make any significant or interesting results more or less useless. I don’t do time series analysis very much and it’s hard to do right so I figure I won’t wade into it this time. (Side note, I do want to get into a bit more modelling in this blog space, but I don’t think these are the right data. Maybe I could do that for my running when I have more months’ worth of data and it’s such a clearly linear trend of increased mileage and performance.)\nHere’s a look at my median performance by month.\n\n\n\nAfter seeing the grpahs for mileage, it shouldn’t be a surprise that my performance goes up continually once the fall settles in. Here’s the same look by week for a more granular look.\n\n\n\nThis also checks out - not sure when the week is that I had the massive median performance. It could have been mid November when I ran my first half marathon. That would make sense.\nI wanted to include a section in here with a map of my routes, but for some reason, the leaflet package doesn’t want to work with R Markdown knitting right now. So I took it out for now, but hopefully I’ll be able to figure it out and get it in here at a later time. If I do, I’ll be sure to mention it!\nBut this is all for now. I could do a lot more with this, but honestly, I just want to publish this. I’ve been working on it for several months now and I’ve only just worked up the motivation to finish it. So here it is! Woo!\n\n\n\n",
    "preview": "posts/2020-12-13-analyzing-my-running-performance-using-strava-data/analyzing-my-running-performance-using-strava-data_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2021-03-27T17:56:35-05:00",
    "input_file": "analyzing-my-running-performance-using-strava-data.utf8.md"
  },
  {
    "path": "posts/2020-12-07-a-true-welcome/",
    "title": "A true welcome",
    "description": "Why I'm here",
    "author": [
      {
        "name": "Cody Tuttle",
        "url": "https://codyrtuttle.netlify.app/"
      }
    ],
    "date": "2020-12-07",
    "categories": [],
    "contents": "\nGreetings, esteemed guest!\nI’m so glad you made it to my site. Whether you’ve known me for a long time and you’re only here because I asked you to check it out, or we’ve never met and you stumbled across this somehow, thanks for being here. I know that there are a lot of other places on the internet you could be and a lot of other things you could be doing with your time, so that you’ve chosen to spend a few minutes here is something I don’t take lightly. Thanks.\nI wanted to take a few minutes to jot down some thoughts about why I started this and what I’m doing here. As you probably figured out by now, this is my site where I blog about data and public policy. I’m a research scientist and policy analyst by trade, and I love working with data - this is my creative outlet to explore the areas that I’m passionate about and get better at my craft. Exploring new data sets about topics that I care about is really exciting to me, because I get to both learn a lot and help people out in the process. One of the ways that I learn best is by following along as people show me how to do something, and that applies to data science especially. I love finding new data and R blogs to follow and explore, particularly when they’re at a skill level that’s close to mine or just slightly more advanced. Hopefully this site can be that kind of a resource to people who are interested in improving their data tool box.\nOld site\nThis site is really a reincarnation of a previous blog that I started back in the summer of 2019. I was on break from my MPP program at the time, only doing an internship and no classes, and I wanted to do something productive with my down time that would help my job prospects once I graduated, either in terms of actual experience and skill-sharpening or just a portfolio to point to. Over the course of the summer I really started to enjoy the process of exploring new data sets and writing about both my process of analaysis and visualization and also the insights and thoughts I was pulling from the analysis. I did circa 10 posts over the course of around three months, most of them going through new data sets in R, but also some posts about Tableau public dashboards I’d made or with my thoughts about a particular policy area that I’d been thinking about a lot. After school started back up again in the fall I wasn’t able to keep it up, but I did do a few more posts during the winter break between fall and spring semesters. Since I graduated in May 2020, I’ve been meaning to pick it back up again, but time the last six months has gotten away from me, with starting a new full-time job, buying a house, finding out that my wife and I are expecting our first child, and general COVID craziness. I also knew that I wanted to create a new site, which would take some planning and investment on top of the time to actually write new posts. My old site, while functional and serviceable, didn’t look that great and it was not at all integrated with the rest of the writing and analysis workflow I’ve developed in RStudio and R Markdown.\nNew site!!!\nEnter this new site! After things At various points over the last year, I’ve seen posts and resources on various ways to start blogs using R packages, like blogdown and distill, but I wasn’t able to really sit down and start thinking about it until now. I tried starting a site using blogdown and Hugo, and while I’m sure it’s a great tool that works for a lot of folks, I wasn’t able to get it to work. One of the other posts that I’d seen, though, was this one from Tom Mock about starting a blog using distill and Netlify - it worked a lot more seamlessly for me than did the blogdown approach, and now we find ourselves here!\nMostly, I see this new site as a better-looking and easier-to-work-with continuation of the old site in terms of content and purpose. I’m really excited to get back to exploring new data sets and getting better at my analysis and visualization skills, so I imagine that will by main focus for the first stage in this new site. I’d also like to explore new territory with this blog, though. There are a few domains that I’ve been really itching to get into, like machine learning, interacative web graphics using d3 and JavaScript, and I’d love to use this as a way to explore them. I’d also like to create more Shiny web apps and blog about them here. Currently I have one Shiny app that I made for a class, and I’ve been meaning to build more - it’s a super fun platform.\nRight now I’m thinking that the first new post that I do here will be analyzing my Strava app running data. I figured out how to download it a few weeks ago and I’ve had a good time playing around with it. I’m also debating building a Shiny app for it, but that remains to be seen. Other than that, I’m wide open to new data sets and topics.\nWell, folks, that’s all for now. If you want to learn more about me, check out the “About” page on the site. Thanks for stopping by and taking the time to read this - I’m looking forwrad to posting more soon!\n\n\n\n",
    "preview": {},
    "last_modified": "2020-12-08T14:46:12-06:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-12-02-cfpb-analysis/",
    "title": "CFPB Analysis",
    "description": "A repurposing of a post I did on my old blog site last January. Wanted to get some content up here to see how the workflow goes.",
    "author": [
      {
        "name": "Cody Tuttle",
        "url": {}
      }
    ],
    "date": "2020-12-02",
    "categories": [],
    "contents": "\n*Update: repurposing this post for my new blog site! will actually have a new post detailing catching everyone up on everything soon\nHello everyone! Welcome back to my blog - it’s been way too long, I know, but I’m back for a post before I start my new semester (my final semester of grad school HALLELUJAH). As much as I want to update you on my life and everything, I’m going to skip the pleasantries and just get straight to the post. I don’t really have time to get into all that I want to with the data as it is, so I probably shouldn’t take the time to update you on my life when you probably wouldn’t read it anyways.\nIn this post I’m going to be looking at data from the 2016 National Financial Well-Being Survey, published by the Consumer Financial Protection Bureau. As you can probaby guess, it’s a survey about people’s financial well-being, with questions about financial skills, behaviors, attitudes, experiences, etc., as well as demographics like race, employment, poverty status, urban/rural, etc. Since interning at the Federal Reserve Bank last summer, I’ve definitely gained more of an interest in financial issues and credit and such, especially racial inequities within access to credit and financial services. So that’s what I’ll be looking at in this post. There’s a lot in these data that I won’t have time or space to go into wtih this post that I’d like to - urban/rural differences, gender differences, educational differences, regional differences, not to mention all of the financial measures that I won’t get to look at.\n(As a quick plug, I found the data from a site called Data is Plural, which has a spreadsheet of hundreds of interesting data sets, updated every week. Check it out.)\nThe main thing that I want to look at in this post is racial differences in access to credit, and whether/how that can be explained by poverty status and financial well-being and financial skill. One of the central features of banking and lending history in America is racial discrimination. Practices such as redlining shaped the current urban housing landscape, and though now illegal, discriminatory lending practices are still rampant. Several years ago there was a decently prominant story by Reveal News discussing how people of color and minorities are more likely to be turned down for a loan than whites across many metro areas. Defenders of this dynamic say that its justified by lower credit scores for minorities, and insist that black people are just worse with money and aren’t as credit worthy. While credit scores aren’t public data and therefore can’t be explored as factor in racial disparities in lending, studies have shown that credit score algorithms have a discriminatory impact on people of color. So even if credit scores do account for differences in lending, that doesn’t explain away discrimination.\nWith that, let’s get into the data.\nData Loading and Survey Weights\nHere I simply load in my data (already mostly cleaned thanks to a handy R script provided by CFPB) and set it up as a survey. I decided to use the srvyr package, which lets you work with survey dataframes in tidyverse style. After adding the survey weights in the code below, we should be good to go.\n\n\ndata <- read.csv(\"/Users/codytuttle/Desktop/cfpb_blog/cfpb_clean.csv\")\nlibrary(\"pacman\")\np_load(tidyverse, survey, srvyr)\nweighted <- data %>%\n  as_survey(PUF_ID, weight = finalwt) %>%\n  rename(race = PPETHM, \n         incomecat = PPINCIMP) %>%\n  mutate(rejected = ifelse(REJECTED_1 == \"Yes\", 1, \n                           ifelse(REJECTED_1 == \"No\", 0, 99)))\n\n\n\nAccess to Credit\nThe first thing that I want to do is look at overall racial disparities in access to credit using a survey question that asks whether a respondent applied for credit and was turned down in the last year.\n\n\nweighted %>%\n  group_by(race) %>%\n  filter(rejected != 99) %>%\n  summarize(rejected = survey_mean(rejected)) %>%\n  ggplot(aes(x = race, y = 100*rejected, group = race)) +\n    geom_bar(stat = \"identity\", fill = \"blue\") +\n    theme_minimal() +\n    labs(x = \"Racial Group\", y = \"% rejected\") +\n    ggtitle(\"Credit Rejection by Racial Group, 2016\")\n\n\n\n\nThis chart shows astounding racial disparities in lending - black respondents were over twice as likely to report being turned down for a loan in the past year than whites, and Hispanics were nearly 50% more likely than whites.\nHowever, while these differences are stark, in and of themselves they don’t necessarily constitute discrimination. There are certain characteristics not accounted for in that graph, primarily income, that could account for the observed differences. To take one step further in exploring whether or not these disparities could be evidence of discrimination, below I chart the same measure of being rejected for a loan by both income category and race. I limit the racial categories to just black and white, both to focus on the starkest disparities and to minimize clutter on the graph.\n\n\nweighted %>%\n  filter(race == \"Black, Non-Hispanic\" | race == \"White, Non-Hispanic\", rejected != 99) %>%\n  group_by(race, incomecat) %>%\n  summarize(rejected = survey_mean(rejected)) %>%\n  ggplot(aes(x = incomecat, y = 100*rejected, group = race, fill = race)) +\n    geom_bar(stat = \"identity\", position = \"dodge\") +\n    theme_minimal() +\n    theme(axis.text.x = element_text(angle = 45, vjust = 0.9, hjust = 1)) +\n    labs(x = \"Income Category\", y = \"% rejected\", fill = \"Racial Group\") +\n    ggtitle(\"Credit Rejection by Income Category and Racial Group, 2016\")\n\n\n\n\nHere we can see that the racial disparities in lending observed in the first chart persist even after controlling for income, and may even be starker. Across every single income category, black respondents are rejected at a higher rate than white respondents, generally at a two to three times higher rate, at least. If the decision to lend is about the borrower’s ability to pay it back, then income should be a pretty good metric. But even holding income equal, there are still massive racial disparities in lending.\nHowever, givng them the benefit of the doubt, maybe lenders are picking up on some other factor besides race that are causing them to reject disproportionately more black folks. In the next graph I look at the financial skills score by race and by income category and race. Even if it’s not a measure that’s directly used by lenders, it still probably can be a proxy for overall creditworthiness.\n\n\nweighted %>%\n  filter(race == \"Black, Non-Hispanic\" | race == \"White, Non-Hispanic\") %>%\n  group_by(race) %>%\n  summarize(finskill = survey_mean(as.numeric(FSscore))) %>%\n  ggplot(aes(x = race, y = finskill)) +\n    geom_bar(stat = \"identity\", fill = \"blue\") +\n    theme_minimal() +\n    theme(axis.text.x = element_text(angle = 45, vjust = 0.9, hjust = 1)) +\n    labs(x = \"Race\", y = \"Financial Skills Score\") +\n    ggtitle(\"Financial Skills Score by Race, 2016\")\n\n\n\nweighted %>%\n  filter(race == \"Black, Non-Hispanic\" | race == \"White, Non-Hispanic\") %>%\n  group_by(race, incomecat) %>%\n  summarize(finskill = survey_mean(as.numeric(FSscore))) %>%\n  ggplot(aes(x = incomecat, y = finskill, group = race, fill = race)) +\n    geom_bar(stat = \"identity\", position = \"dodge\") +\n    theme_minimal() +\n    theme(axis.text.x = element_text(angle = 45, vjust = 0.9, hjust = 1)) +\n    labs(x = \"Income Category\", y = \"Financial Skills Score\", fill = \"Racial Group\") +\n    ggtitle(\"Financial Skills Score by Income Category and Race, 2016\")\n\n\n\n\nWell, it doesn’t look like giving lenders the benefit of the doubt is working out very well - both overall and across each income category, black respondents actually have very similar financial skills scores as whites, if not higher.\nBear with me, because now I’m about to get a bit more weedsy. In the next few graphs I’m going to really try and get to the bottom of this issue as best as I can using these data and without using any fancy statistical techniques (this is neither the time nor the place for that). These charts will look at the financial skills scores of the following groups: all rejected applicants; all accepted applicants; rejected white applicants vs. accepted black applicants; and rejected black applicants vs. accepted white applicants.\n\n\nweighted %>%\n  filter(race == \"Black, Non-Hispanic\" | race == \"White, Non-Hispanic\", rejected == 0) %>%\n  group_by(race, incomecat) %>%\n  summarize(finskill = survey_mean(as.numeric(FSscore))) %>%\n  ggplot(aes(x = incomecat, y = finskill, group = race, fill = race)) +\n    geom_bar(stat = \"identity\", position = \"dodge\") +\n    theme_minimal() +\n    theme(axis.text.x = element_text(angle = 45, vjust = 0.9, hjust = 1)) +\n    labs(x = \"Income Category\", y = \"Financial Skills Score\", fill = \"Racial Group\") +\n    ggtitle(\"Financial Skills Score of Rejected Credit Applicants by Income and Race, 2016\")\n\n\n\nweighted %>%\n  filter(race == \"Black, Non-Hispanic\" | race == \"White, Non-Hispanic\", rejected == 1) %>%\n  group_by(race, incomecat) %>%\n  summarize(finskill = survey_mean(as.numeric(FSscore))) %>%\n  ggplot(aes(x = incomecat, y = finskill, group = race, fill = race)) +\n    geom_bar(stat = \"identity\", position = \"dodge\") +\n    theme_minimal() +\n    theme(axis.text.x = element_text(angle = 45, vjust = 0.9, hjust = 1)) +\n    labs(x = \"Income Category\", y = \"Financial Skills Score\", fill = \"Racial Group\") +\n    ggtitle(\"Financial Skills Score of Accepted Credit Applicants by Income and Race, 2016\")\n\n\n\nweighted %>%\n  filter((race == \"Black, Non-Hispanic\" & rejected == 0) | \n           (race == \"White, Non-Hispanic\" & rejected == 1)) %>%\n  group_by(race, incomecat) %>%\n  summarize(finskill = survey_mean(as.numeric(FSscore))) %>%\n  ggplot(aes(x = incomecat, y = finskill, group = race, fill = race)) +\n    geom_bar(stat = \"identity\", position = \"dodge\") +\n    theme_minimal() +\n    theme(axis.text.x = element_text(angle = 45, vjust = 0.9, hjust = 1), \n          plot.title = element_text(size = 10)) +\n    labs(x = \"Income Category\", y = \"Financial Skills Score\", fill = \"Racial Group\") +\n    ggtitle(\"Financial Skills Score of Rejected White Credit Applicants vs. \n            Accepted Black Applicants by Income, 2016\")\n\n\n\nweighted %>%\n  filter((race == \"Black, Non-Hispanic\" & rejected == 1) | \n           (race == \"White, Non-Hispanic\" & rejected == 0)) %>%\n  group_by(race, incomecat) %>%\n  summarize(finskill = survey_mean(as.numeric(FSscore))) %>%\n  ggplot(aes(x = incomecat, y = finskill, group = race, fill = race)) +\n    geom_bar(stat = \"identity\", position = \"dodge\") +\n    theme_minimal() +\n    theme(axis.text.x = element_text(angle = 45, vjust = 0.9, hjust = 1), \n          plot.title = element_text(size = 10)) +\n    labs(x = \"Income Category\", y = \"Financial Skills Score\", fill = \"Racial Group\") +\n    ggtitle(\"Financial Skills Score of Rejected Black Credit Applicants vs. \n            Accepted White Applicants by Income, 2016\")\n\n\n\n\nHere we go: First, for all rejected credit applicants, we see the same pattern of black respondents having similar or slightly higher financial skills scores than white respondents. Second, the pattern holds for all accepted applicants. No surprises there.\nThird, when we look at rejected black applicants vs. accepted white applicants, in order for there to be any justification of disparities at all, rejected black repondents should have clearly lower financial skills scores than accpeted white applicants. We do see this across several income categories, but it doesn’t at all appear to be the norm - we see very similar financial skills between rejected blacks and accepted whites for three categories, and rejected blacks even have moderately higher financial skills scores than accepted whites for one income category.\nFourth, in order to justify the somewhat similar or even higher financial skills scores for rejected black applicants vs. accepted whites, we should see a similar pattern for rejected whites vs. accepted blacks (i.e., sometimes rejected whites have similar or higher financial skills than accepted blacks). However, we don’t see this pattern at all - across every income bracket, accepted black applicants have far and away higher financial skills scores than rejected whites.\nIn other words, the decision to reject a white applicant vs. accepting a black applicant with a similar income is clearly justified, at least in terms of financial skills, while the same cannot necessarily be said for rejecting a black applicant. To me, this suggests that black applicants for credit are held to a much higher standard than white appliants with similar credentials. In order for the observed disparities in credit rejection to be justified, there would have to be very clear differences between the many black applicants that are rejected and the whites that are accepted. However, we don’t see that - the disparities persist even after controlling for income, and often times financial skills as well.\nThis to me is evidence that the observed racial disparities in lending are indeed indicative of discrimination. At the very least, even if not outright discrimination, it’s clear that black applicants are held to a much higher standard in credit decisions than whites with similar incomes. It would be foolish of me to claim that this analysis represents any kind of causal or definitive proof of discrimination - this is just one measure based on a survey that doesn’t account for actual credit score. But in my view, it represents one more piece of evidence that across so many sectors, banking and credit included, black people and people of color are not treated the same as whites.\nAs always, I welcome your questions, comments, and feedback. I doubt I’ll be able to post again until this summer, but I’m really glad I was able to do this before my semester started again. Until next time!\n\n\n\n",
    "preview": "posts/2020-12-02-cfpb-analysis/cfpb-analysis_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2020-12-02T18:10:00-06:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to CRT Blog",
    "description": "Hi, I'm Cody! Welcome to my new blog. I hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Cody Tuttle",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-01",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2020-12-02T17:18:25-06:00",
    "input_file": {}
  }
]
